const express = require('express');
const app = express();
const expbs = require('express-handlebars');

app.engine('handlebars', expbs( { defaultLayout : 'main'}));
app.set('view engine', 'handlebars');


app.get('/image.jpg', (req, res) => {
  res.sendFile(__dirname + '/image.jpg');
})

app.get('/noumenon_', (req, res) => {
     res.render('poems', { 
     title: "Вещь в себе",
     preface: "Самопальная медитативная форма. <br> Одно в другом, два в одном.",
     poems : [
     {lines : ["пенальти в тишине"], epigraph: "чужая танкетка"},         
     {lines : ["индийка в Индигирке"]},
     {lines : ["Гарвард в Кембридже"]},
     {lines : ["кенгуру в Шенбрунне"]},
     {lines : ["одиночество в общежитии"]},
     {lines : ["саверма в Самаре"]}
     ]});
});
app.get('/words', (req, res) => {
     res.render('poems', { 
     title: "Неологизмы",
     poems : [
     {lines : ["твочер"]},
     {lines : ["рукировка"]},
     {lines : ["нувостройка"]},
     {lines : ["левгей"]},
     {lines : ["изморкофе"]},
     {lines : ["дистрибукт"]},
     {lines : ["саградостроительство"]},    
     {lines : ["цвишенцугцванг"]},    
    ]});
});

app.get('/gariks', (req, res) => {
     res.render('poems', { 
     title: "Гарики",
     poems : [
     {lines : ["кто шахматистом станет первым", "вопросом стало знаменитым", "норвежц индусу портит нервы", "волнуя кровь семитам"]},         
     {lines : ["признаем что среди евреев", "по ряду косвенных призна'ков", "гораздо больше сельдереев", "чем пастернаков"]}        
     ]});
});


app.get('/side', (req, res) => {
     res.render('poems', { 
     title: "Взгляд сбоку",
     poems : [
     {lines : ["здесь в  Козловском переулке", "он не знал куда идти", "<br>", "постречался я, прохожий,", "подсказал куда идти", "<br>", "проходя по переулку", "снова вспомнил он меня"]},
     {lines : ["я оглянулась посмотреть не оглянулся ли он", "чтоб посмотреть не оглянулась ли я"]}
       ]});
});

app.get('/haiku', (req, res) => {
     res.render('poems', { 
     title: "Свободные хокку",
     poems : [
     {lines : ["Шторку для ванной", "в виде ковра", "повешу на стену"]},
     {lines : ["Стихи на снегу", "строчки", "бяквы и буквы"]}
       ]});
});

app.get('/575', (req, res) => {
     res.render('poems', { 
     title: "Строгие хокку",
     poems : [
     {lines : ["Я как улитка", "занимаюсь хайкингом", "на склоне Фудзи"]},         
     {lines : ["ветка сакуры", "Всеволод Овчинников", "читать бесплатно"]},
     {lines : ["одностишие", "маринованный имбирь", "одностишие"]}
     ]});
});

app.get('/landscapes1', (req, res) => {
     res.render('poems', { 
     title: "Пейзажная лирика",
     preface: "Иной раз названия пейзажей настолько удачны сами по себе, что собственно картина уже и не нужна; во всяком случае, название может существовать совершенно отдельно, а ваше воображение дорисует всё остальное.",
     poems : [

     {lines : ["сентябрь", "георгины цветут", "сельские ритмы"], epigraph: "Виктор Батьянов"},         
     {lines : ["весна", "большая вода"], epigraph: "Исаак Левитан"},
     {lines : ["зима", "пятна света на крышах хат"], epigraph: "Архип Куинджи"},
     {lines : ["осенний день", "Сокольники"], epigraph: "Исаак Левитан"}         
     ]});
});

app.get('/2_', (req, res) => {
     res.render('poems', { 
     title: "В два слова",
     preface: "Часто стихотворение крутится вокруг двух слов. Я решил оставить только их, оригиналы ищите сами)",
     poems : [    
     {lines : ["нет / никогда"]},
     {lines : ["лебедь / блядь"]},
     {lines : ["поэт / бильярд"]},
     {lines : ["блажество / беспокойство"]},
     {lines : ["рассвет / Переделкино"]}
     ]});
});

app.get('/35', (req, res) => {
     res.render('poems', { 
     title: "Троепятки",
     poems : [
     {lines : ["морошка", "разоблачена"]},
     {lines : ["я гольдшмидт", "своего счастья"]},
     {lines : ["это я", "Эрик Булатов"]},
         
     {lines : ["бабочки", "осенних листьев"]}
     ]});
});

app.get('/mindlessness', (req, res) => {
     res.render('poems', { 
     title: "Задумки",
     poems : [
     {lines : ["чёрный дебют белыми фигурами"]},
     {lines : ["моя контрольная с ФИО соседа по парте"]},
     {lines : ["зубная паста со вкусом крема для бритья"]}
     ]});
});

app.get('/train', (req, res) => {
     res.render('poems', { 
     preface: "Два населённых пункта и эстетическое напряжение, которое они создают.",
     title: "Поезда",
     poems : [

     {lines : ["Зурбаган", "Лис"]},         
     {lines : ["Харьков", "Лисичанск"]},
     {lines : ["Магадан", "Юрмала"]},
     {lines : ["Кишинёв", "Сент-Луис"]},         
     {lines : ["А", "Б"]}    
     ]});
});

app.get('/plagiarism', (req, res) => {
     
     res.render('poems', { 
     preface: "Мои стихи, кем-то уже написанные.",
     title: "Плагиат",
     poems : [
     {lines : ["винодел", "недолив"], epigraph : "танкетка"},
     {lines : ["Алексей", "Верницкий"], epigraph : "танкетка"},
     {lines : ["деньгами", "не пахнет"], epigraph : "танкетка"},
     {lines : ["Осташков", "фисташков"], epigraph : "танкетка"},
     {lines : ["атом", "поэзии"], epigraph : "танкетка"},
     {lines : ["как хорошо что я другой", "а не какой-нибудь такой"], epigraph : "Герман Лукомников"},
     {lines : ["ври", "в рифму"], epigraph : "Герман Лукомников"},
     {lines : ["А", "К", "Р", "О", "С", "Т", "И", "X"], epigraph : "Александр Кондратов "}
     ]});
});

app.get('/12', (req, res) => {
     res.render('poems', { 
     title: "Слово в две строки",
     poems : [
     {lines : ["транс-", "понанс"]},
     {lines : ["ан-", "жамбеман"]},
     {lines : ["обер-", "хуёбер"]}
     ]});
});


app.get('/rotki', (req, res) => {
     res.render('poems', { 
     title: "Ротки",
     poems : [
     {lines : ["зелёный", "серый", "алый"]},
     {lines : ["коричневый", "розовый", "нежно-зелёный", "стальной"]}
     ]});
});


app.get('/bananals', (req, res) => {
     res.render('poems', { 
     preface: "Название говорит за себя. Тупо, но иногда забавно. Врочем, пенки уже сняты Германом Лукомниковым)",
     title: "Банальности",
     poems : [
     {lines : ["<font color='red'>футбол", "гол</font>"], epigraph: "Герман Лукомников"},
     {lines : ["футбол", "фол"]},
     {lines : ["гит", "коммит"]},
     {lines : ["контест", "тест"]},
     {lines : ["гугл", "дудл"]}    
     ]});
});

app.get('/squeeze', (req, res) => {
     res.render('poems', { 
     title: "Выжимки",
     poems : [
     {lines : ["<font color='red'>Иван Ахметьев</font>"]},
     {lines : ["нужно ли больше"]},
     {lines : ["что еще сказать  не знаю"]},
     {lines : ["ручка не пишет"]},
     {lines : ["конечно", "что я за поэт", "моих стихов"]},
     {lines : ["почему это стихи", "самому неясно"]},
     {lines : ["только не писали", "главное"]},
     {lines : ["         я не уверен", "как поэт"]},
     {lines : ["наслаждение для уш"]},
     {lines : ["мои стихи рассчитаны"]},
     {lines : ["я как Микеланджело"]} 
     ]});
});

app.get('/auto_26', (req, res) => {
     res.render('poems', { 
     title: "Автотанкетки",
     poems : [
     {lines : ["бляди", "сухиничи"]},
     {lines : ["рифма", "к слову себя"]},
     {lines : ["смотреть", "фильм про тюрьма"]},
     {lines : ["спеши", "любить ноты"]},
     {lines : ["радости", "рыбалки"]},
     
     ]});
});

app.get('/poroshki', (req, res) => {
     res.render('poems', { 
     title: "Порошки",
     poems : [
     {lines : ["изгой отвергнутый средою", "твердит что сам её отверг", "и ждёт когда уже наступит", "четверг"]},
     {lines : ["латынь из моды вышла ныне", "так если правду вам сказать", "он знал довольно по латыне", "чтоб спать"]}     
     ]});
});

app.get('/artichokes', (req, res) => {
     res.render('poems', { 
     title: "Артишоки",
     poems : [
     {lines : ["когда я чуть-чуть выхожу из себя", "и вижу вселенную сбоку", "становится сразу любая хуйня", "хокку"]}
     ]});
});


app.get('/zh-p', (req, res) => {
     res.render('poems', { 
     preface: "Публикации <a href=\"https:\\\\vk.com/prish_magazine\">вконтакте</a>. Там, кажется, публикуют всех подряд, даже меня :)",
     title: "Журнал Прыщ",
     poems : [
     {lines : ["где родился", "тем и возгордился", "<br>", "оттуда и понаехал"]},    
     {lines : ["OX", "&nbsp;&nbsp;&nbsp;&nbsp;OX", "&nbsp;&nbsp;&nbsp;&nbsp;XO"]},    
     {lines : ["отдай лишнюю рубашку", "<br>", "отбери лишнюю рубашку", "<br>", "вот и вся разница", "между христианством и социализмом"]},    
     {lines : ["хронос", "космос", "раса", "вирус", "эрос", "<br>", "набросал вариантов", "как Ровшан Аскеров"]},    
     {lines : ["но нет не только рулевого ", "но и руля как такового"]},    
     {lines : ["почему некрасивых не любят?", "это может красивых не любят,", "то есть любят, но как же проверить,", "что не только за то, что красивы? ", "а когда некрасивых полюбят,", "тут уж ясно, что точно за дело,",  "а красивые лишь красотою", "и спасаются"]},
     {lines : ["дистрофика", "<br>", "дистрофика"]},
     {lines : ["только голову намылил", "глядь звонок звенит", "- алло, это телевиденье, да?"]},
     {lines : ["Я хочу получить сотню лайков", "ох вы, лайки мои, балалайки,", "ну, не сто, не полсотни,", "я согласен на десять, пятнадцать,", "на пять лайков."]},
     {lines : ["я конечно хороший поэт", "это я сознаю без иллюзий", "да что сделать —  какой уже есть", "правда мог бы я быть и похуже", "правда если б похуже я был", "написал бы я точно не меньше",  "и пришлось бы всё это читать", "так что лучше скажите спасибо"]},
     {lines : ["когда б мы знали, из какого сорта,", "а то ведь он бывает разный, сорт-то"]},
     {lines : ["Чу!", "Я молчу"]},
     {lines : ["ан-", "жамбеман"]},
     {lines : ["с т", "т и", "а м", "л г", "а а", "к л", "т а", "и т", "т с"]},
     {lines : ["чашка чая", "кошка кофе", "<br>", "и какао"]},
     {lines : ["– Я здесь, Инезилья, я здесь под окном.", "<br>", "– Пошел на хуй, Антонио!"]},
     {lines : ["ЖИВУ * ВИЖУ = БУЛАТОВ", "<br>", "(5419 * 1459 = 7906321)!"]}, 
    {lines : ["стихи все делятся на не стихи", "и на стихи в привычном смысле", "все не стихи не то чтобы сухи", "но непонятны в высшем смысле", "<br>", "а все стихи не то чтобы стихи", "а просто чувства выраженье", "что и не скажешь точно, что стихи", "но знаешь точно: рифма есть, и ладно"]}, 
     {lines : ["399725722782532944388077717044552088857010024925364224", "(перед вами Холин)"]}, 
     {lines : ["перечитайте Пукшина"]}, 
     {lines : ["Граждане, не забывайтесь!", "штраф 500 рублей"]}, 
     {lines : ["варенье из ирги", "<br>", "изреки", "изрыги", "<br>", "что такое ирга", "игра", "<br>", "не такого понятья", "ирга", "<br>", "но есть", "<br>", "варенье из ирги"]},
     {lines : ["не мог ямба от хорея", "не отличить!"]},    
     {lines : ["и даже в сквере имени Урицкого", "никто не знает имени Урицкого"]},
     {lines : ["Беги, беги, дорожка.", "Стихи Яна Сатуновского.", "Рисунки Марины Басмановой."]},
     {lines : ["один", "<br>", "два", "<br>", "три", "<br>", "четыре", "<br>", "пять", "<br>", "шесть", "<br>", "вагон-ресторан", "<br>", "семь", "<br>", "восемь", "<br>", "девять", "<br>", "десять"]},
     {lines : ["главное?", "главное иметь!", "<br>", "главное иметь нахальство?", "главное иметь нахальство знать!", "<br>", "главное иметь нахальство знать что?", "главное иметь нахальство знать что это!", "<br>", "главное иметь нахальство знать что это стихи? "]}
     ]});
});


app.get('/samara', (req, res) => {
     res.redirect('https://zen.yandex.ru/id/5eb317ff539faf1b27a44081')
});

app.get('/love_lyrics', (req, res) => {
     res.redirect('https://vk.com/cool_cacao')
});


app.get('/forks', (req, res) => {
     res.redirect('https://www.pinterest.ru/poetry_forks/')
});


app.get('/landscapes', (req, res) => {
     res.redirect('https://www.flickr.com/photos/landscape-lyrics')
});


app.get('/chess', (req, res) => {
     res.redirect('https://www.chess.com/blog/ru-poetry')
});

app.get('/cmuxu-o-cmuxax-o-cmuxax', (req, res) => {
     res.redirect('https://www.facebook.com/Cmuxu-o-Cmuxax-o-Cmuxax-103434751326120')
});

app.get('/monostichs', (req, res) => {
     res.redirect('https://twitter.com/rumonostichs')
});

app.get('/instapoetry', (req, res) => {
     res.redirect('https://www.instagram.com/russian.instapoetry')
});

app.get('/hello_world_poetry', (req, res) => {
     res.redirect('https://t.me/hello_world_poetry')
});

app.get('/bites', (req, res) => {
     res.redirect('https://deviantart.com/rusbites')
});


app.get('/polpotolok', (req, res) => {
     res.redirect('https://polpotolok.tumblr.com')
});



app.get('/2', (req, res) => {
     res.redirect('https://twolrds.artstation.com/projects/1nKG4L')
});


app.get('/noumenon', (req, res) => {
     res.redirect('https://www.pixiv.net/en/artworks/81705617')
});



app.get('/forks1', (req, res) => {
     res.render('poems', { 
     title: "Форки",
     poems : [
     {lines : ["<font color='red'>всё проходит", "как пароходик</font>"], epigraph : "[Герман Лукомников]"},
     {lines : ["всё проходит", "как промокодик"]},
     {lines : ["всё проходит", "как пара годик"]},
     {lines : ["<font color='red'>вдали от мировых проблем", "сижу мороженное ем</font>"], epigraph : "[Герман Лукомников]"},
     {lines : ["вдали от мировых забот", "лежу лижу фруктовый лёд"]},
     {lines : ["как на картинке из кино", "сижу жуюю эскимо"]},
     {lines : ["вдали от слов война и мир", "вкушаю сливочный пломбир"]},
     {lines : ["вдали от всех вселенских бед", "вкусней щербета ем щербет"]},
     {lines : ["вдали от всех свежайших фрукт", "я ем мороженный продукт"]},
     {lines : ["вдали от городов и весь", "варю мороженную смесь"]},
     {lines : ["вдали от всех пишу эссе", "про пью мороженный гляссе"]},

    {lines : ["оставил будних дней орду", "в сугробе с сахаром во рту"]},
     {lines : ["<font color='red'>великий поэт", "пошёл в туалет</font>"], epigraph : "[Герман Лукомников]"},
     {lines : ["великий поэт", "по выслуге лет"]},
     {lines : ["великий поэт", "Афанасий Фет"]},
     {lines : ["великий поэт", "Назым Хикмет"]},
     {lines : ["великий поэт", "чтоб Пушкин так нет"]},
     {lines : ["великий поэт", "в бесплатный туалет"]},
     {lines : ["великий поэт", "по версии рунет"]},
     {lines : ["<font color='red'>больше всего на свете", "люблю я ездить в маршрутке</font>"], epigraph : "[Ксения Букша]"},
     {lines : ["больше всего на свете", "я люблю сидеть в интернете"]},
     {lines : ["больше всего на свете", "я люблю сидеть в туалете"]},
     {lines : ["больше всего на свете", "люблю я ездить в карете"]},
     {lines : ["больше всего на свете", "я люблю стихи но не эти"]},
     {lines : ["<font color='red'>автор этих строк", "плавленный сырок</font>"], epigraph : "[Герман Лукомников]"},
     {lines : ["автор этих строк", "жук-единорог"]},
     {lines : ["автор этих строк", "майский ветерок"]},
     {lines : ["автор этих строк", "мой со мной сурок"]},
     {lines : ["автор этих строк", "пушкинский пророк"]},
     {lines : ["<font color='red'>в тени ветвей", "скачет", "тень воробья</font>"], epigraph : "[Марина Хаген]"},
     {lines : ["в тени судеб", "встречаются", "тени конечностей"]},
     {lines : ["в тени дерева", "рефлексирует", "тень Бродского"]},
     {lines : ["<font color='red'>триста с лишний дней в году", "к остановке я бегу</font>"], epigraph : "[Иван Ахметьев]"},
     {lines : ["триста с лишним дней в году", "за маршруткой я бегу"]},
     {lines : ["триста с лишним дней в году", "сочиняю ерунду"]},
     {lines : ["триста с лишним дней в году", "точной цифры не найду"]}         
     ]});
});

app.get('/porozhki', (req, res) => {
     res.render('poems', { 
     title: "Порожки",
     poems : [
     {lines : ["я так хотел писать танкетки", "делиться мудростью во мне", "да только мудрость неделима", "и не [влезает / в шесть слогов]"]},
     {lines : ["я вас хочу немного тайно", "в надежде грёзах и во сне", "и вас и вас и вас вот тоже", "вас не [хочу / хотя могу]"]},
     {lines : ["прикинь у Cерого на днюхе",  "Витёк сломал ногой строфу", "как Пастернак анжамбеманом", "строфу [где кроме / никого]"]}
     ]});
});

app.get('/redblack', (req, res) => {
     res.render('poems', { 
     title: "Редблеки",
     poems : [
     {lines : ["красное", "<font color='red'>чёрное</font>"]},
     {lines : ["<font color='red'>в</font>ампир/кров<font color='red'>ь</front>"]},
         
     ]});
});

app.get('/haiku_minus_plus', (req, res) => {
     res.render('poems', { 
     preface: "Скомбинированные хокку минус Бориса Гринберга и хокку плюс Германа Лукомникова (идея Владимира Белоброва и Олега Попова). К двум строчкам существующего хокку- я дописываю третью строку в эстетике хокку+, производя обыкновенное хокку.",
     title: "Хокку минус плюс",
     poems : [
     {lines : ["Татьяна Бонч-Осмоловская", "Борис Гринберг", "И Я"]},  
     {lines : ["все пути ведут...", "но лишь один приводит", "ВОПРОС КУДА"]}, 
     {lines : ["Улитка всползла", "Только звёзды всё так же", "ВПРОЧЕМ КТО ИХ СЧИТАЛ"]}, 
     {lines : ["Читаю себя.", "Кое-что понимаю.", "МНОГОЕ НРАВИТСЯ"]}, 
     {lines : ["не могу молчать.", "а говорить не хочу...", "БУДУ ЗАПИСЫВАТЬ"]}, 
     {lines : ["как щиплет травку", "нежданный октябрьский снег", "В СЕРЕДИНЕ АПРЕЛЯ"]}, 
         


     ]});
});

app.get('/merch', (req, res) => {
     res.render('poems', { 
     title: "Футболки",
     poems : [
     {lines : ["1 + 1 = 10", "<br>", "(многие верят)"]},
     {lines : ["я", "не-", "не-", "ре-", "пре-" ,"зе-", "нативе-", "н"]},
     {lines : ["На свитере не написано, ", "Но ты лох в этом свитере.", "(надпись на свитере)"]}, 
     ]});
});


app.get('/42', (req, res) => {
     res.render('poems', { 
     title: "Танкетки 42",
     preface: "Скромная попытка доказать, что танкетки 4 + 2 слога имеют право на существование. В некоторых случаях я просто перевернул чужие танкетки (см. эпиграф), иногда просто чужие стихи, иногда свои)",
         
     poems : [
     {lines : ["распятая", "графа"]},
     {lines : ["милицанер", "Рейган"]},
     {lines : ["а ещё есть", "шум волн"], epigraph : "[Айвенго]"},
     {lines : ["коллекция", "денег"]},
     {lines : ["срочно сниму", "двушку"]},
     {lines : ["там хорошо", "где нас"], epigraph : "[swap]"},
     {lines : ["вода вилы", "пишу"], epigraph : "[swap]"},
     {lines : ["гиперссылка", "сибирь"], epigraph : "[swap]"},
     {lines : ["по кольцевой", "к цели"], epigraph : "[swap]"},
     {lines : ["принял на грудь", "медаль"], epigraph : "[swap]"},
     {lines : ["боденская", "осень"], epigraph : "[из Михаила Безродного]"}
     ]});
});



app.get('/26', (req, res) => {
     res.render('poems', { 
     title: "Мои танкетки",
     preface: "Всё запощено на <a href=\"https:\\\\26.netslova.ru\">сайте про танкетки</a>, но там не указывается автор, поэтому дублирую тут.",
     poems : [
     {lines : ["<font color='red'>апрель", "2020 </font>"]},
     {lines : ["лёгкий", "тэ двадцать шесть"]},
     
     {lines : ["физик", "как синоптик", "<br>", "лирик", "как истопник"]},
     
     {lines : ["ночи", "всё короче", "<br>", "и дни", "совсем одни"]},
     
     {lines : ["пальтишко", "платьишко"]},
     
     {lines : ["понять", "протяжённость", "<br>", "с востока", "на запад", "<br>", "России", "в аршинах"]},
     
     {lines : ["суси", "из лосуси"], epigraph : "увидено"},
     
     {lines : ["завтрак", "послезавтра", "<br>", "обед", "раз в сотню лет", "<br>", "ужин", "вам не нужен"]},
         
     {lines : ["возделать", "из говна", "<br>", "конфетку", "из говна"]},
     {lines : ["сегодня", "акция", "<br>", "восемь", "ханукалей", "<br>", "по цене", "одного"]}, 
     
     {lines : ["заесть", "бы всё потом", "<br>", "миндальным", "пирогом", "<br>", "и просви", "стать щеглом"]}, 
     {lines : ["настанет", "свой черёд", "<br>", "рано", "или поздно", "<br>", "очередь", "подойдёт", "<br>", "или стек", "свернётся"]},
     {lines : ["ария", "на струне", "<br>", "соль каждой", "музыки"]},
     {lines : ["танкам", "гусеницы", "<br>", "танкеткам", "бабочки"]},
     {lines : ["псевдоним", "как игра"]},
     {lines : ["Свердлов", "наст фам Ёбург"]},
     {lines : ["Москва", "музей ночей"]},
     {lines : ["пейзаж", "массаж для глаз"]},
     {lines : ["мы против", "запрета", "<br>", "отрицать", "холокост"]},
     {lines : ["дураки", "дороги"]},
     {lines : ["<font color='red'>март", "2020 </font>"]},
     {lines : ["ночник", "полуночник"]},
     {lines : ["говорят", "что не слух"]},
     {lines : ["бессмертный", "полковник"]},
     {lines : ["совсем", "без ничего"]},
     {lines : ["токсичный", "маскулин"]},
     {lines : ["обэжэ", "ебэжэ"]},
     {lines : ["Орфей", "Чемоданов"]},
     {lines : ["в городе", "ветрянка", "<br>", "на каждом", "фасаде", "<br>", "оспинки", "сплит-систем"]},
     {lines : ["Рубинштейн", "читает", "<br>", "твиттер", "Рубинштейна"]},
     {lines : ["реди-мейд", "секонд-хенд"]},
     {lines : ["завёл", "свой собственный", "<br>", "канал", "в Амстердаме"]},
     {lines : ["но сбылся", "только скайп"]},
     {lines : ["в Самаре", "саверма"]},
     {lines : ["бедный", "то есть старый"]},
     {lines : ["путина", "народа"]},
     {lines : ["льдинки", "поволжские", "<br>", "вечные", "странники"]},
     {lines : ["во кровать", "ворковать"]},
     {lines : ["лучик", "среди тучек"]},
     {lines : ["зарплата", "квартплата"]},
     {lines : ["вещи", "добровещи"]},
     {lines : ["лепидо", "птеролог", "<br>", "Владимир", "Набоков", "<br>", "труд всей", "его жизни", "<br>", "бабочки", "в животе"]},
     {lines : ["носитель", "идиша", "<br>", "взял и", "вылечился", "<br>", "но с тех пор", "осталась", "<br>", "лёгкая", "картавость"]},
     {lines : ["голодать", "с голоду"]},
     {lines : ["и гордый", "внук славян", "<br>", "Серёжа", "Кургинян"]},
     {lines : ["лужицы", "без води"]},
     {lines : ["наш народ", "патриот", "<br>", "не избрал", "либерал"]},
     {lines : ["всемирный", "хоть потом"]},
     {lines : [ "отсрочен", "покуда", "<br>", "но гордый", "парад их", "<br>", "слова", "отыскались", "<br>", "не найден", "порядок"]},
     {lines : ["<font color='red'>февраль", "2020 </font>"]},
     {lines : ["фальшфасад", "хеппифейс"]},
     {lines : ["Англо", "Язычные", "<br>", "Скучают", "Вывески"]},   
     {lines : ["Быстрый", "Решительный", "<br>", "Русский", "Композитор", "<br>", "Юрий", "Шостакович"]},
     {lines : ["когда", "спрашивают", "<br>", "как я", "провёл лето", "<br>", "всегда", "отвечаю", "<br>", "писал", "роман в стихах"]},   
     {lines : ["А Вэ", "ввёл танкетки", "<br>", "А вы", "ввели танки"]},
     {lines : ["остудить", "солдатам", "<br>", "осудить", "поэтам"]},
     {lines : ["какая-с", "лепота", "<br>", "как вид", "со смотровой", "<br>", "Кёльнского", "собора"]},
     {lines : ["планета", "поэта", "<br>", "атом", "поэзии"]},
     {lines : ["веб-лира", "верлибра"]},
     {lines : ["кенгуру", "в Шёнбрунне"]},
     {lines : ["скифы мы", "с кипами"]},
     {lines : ["я тоже", "так смогу", "<br>", "сказал я", "сам себе"]},
     {lines : ["подбросишь", "монетку", "<br>", "родится", "кореец"]},
     {lines : ["хайку", "курильщика"]},
     {lines : ["мусор", "не выношу"]},
     {lines : ["февраль", "и ни хрена"]},
     {lines : ["Сталинград", "Бурлаки", "<br>", "в Волге", "много воды"], "epigraph" : "из трёх Некрасовых"},
     {lines : ["пёстро", "берёзовый", "<br>", "в красную", "капельку", "<br>", "зимний", "приговский лес"]},
     {lines : ["<font color='red'>январь", "2020 </font>"]},
     {lines : ["платная", "версия", "<br>", "мира", "немецкого"], epigraph : "Австрия"},   
     {lines : ["планета", "согрета", "<br>", "и чуть", "перегрета"]},   
     {lines : ["чепуха", "нелегка"]},
     {lines : ["кабан на", "комбайне"]},
     {lines : ["целебный", "курвоздух"]},
     {lines : ["фезря", "пожертвовал"]},
     {lines : ["свобода", "от мыслей"]},
     {lines : ["стайл-гайд", "для дресс-кода"]},
     {lines : ["кисти", "живописте"]},
     {lines : ["хинкали", "икали"]},
     {lines : ["поток", "зазнания", "<br>", "потуг", "сознания"]},   
     {lines : ["для графа", "де ла Фер"]}, 
     {lines : ["после", "Освенцима"]},
     {lines : ["пуд соли", "по вкусу"]},
     {lines : ["не нашлось", "местечка"]},
     {lines : ["яма", "Мандельштама"]},
     {lines : ["справа", "Парк культуры", "<br>", "слева", "Парк скульптуры"]},   
     {lines : ["<font color='red'>декабрь", "2019 </font>"]},
     {lines : ["подарки", "под ёлку", "<br>", "поделки", "под арку"]},
     {lines : ["первомай", "черномор", "<br>", "и опять", "первомай"], epigraph : "из Некрасова"},
     {lines : ["так учил", "учитель", "<br>", "главное", "слышать звон"]},
     {lines : ["пексесо", "из носков"]},
     {lines : ["Дали", "Окуджавы", "<br>", "грузинских", "палестин"]},
     {lines : ["гендер", "гендер гендер", "<br>", "что-то", "еврейское"]},
     {lines : ["запах", "мандаринов"]},
     {lines : ["упростил", "Вас до вас"]},
     {lines : ["хателос", "танцавать"]},
     {lines : ["русская", "бумажка", "<br>", "народный", "промысел", "<br>", "синим", "по белому", "<br>", "цветочки", "подписей"]},
     {lines : ["мои", "наушники", "<br>", "сексоты", "стукачи"]},
     {lines : ["носорог", "так видит"]},    
     {lines : ["<font color='red'>ноябрь", "2019 </font>"]},
     {lines : ["отродясь", "двадцать пять"]},
     {lines : ["жираф", "жирафихи", "<br>", "длинно", "шееее"]},
     {lines : ["уместил", "целый мир"]},
     {lines : ["Юрий Дудь", "с кем-нибудь"]},
     {lines : ["вместо", "одной восьмой", "<br>", "стала", "одной одной", "<br>", "одна", "девятая"]},
     {lines : ["я как", "Микеланджел"]},
     {lines : ["поэт", "но деньги есть", "<br>", "это", "идиллия", "<br>", "деньги есть", "но поэт", "<br>", "это", "элегия"]},
     {lines : ["типичный", "водолей", "<br>", "пространных", "соловей"]},
     {lines : ["Карел", "Фабрициус", "<br>", "щегол", "Мандельштама"]},
     {lines : ["планета", "Ньюпитер"]},
     {lines : ["английский", "свободно", "<br>", "русский", "с рифмовником"]},
     {lines : ["дождик", "ундервуда"]},
     {lines : ["ОКЕАН", "личности"]},
     {lines : ["печаль", "шоколада", "<br>", "насмешки", "прохожих"]},
     {lines : ["лечу", "над фьордами", "<br>", "снится", "каждую ночь"]},
     {lines : ["прохожий", "внушает", "<br>", "когда он", "с ушами"]},
     {lines : ["речушки", "рюшечки"], epigraph : "Анси"},
     {lines : ["кот Мурр", "Шрёдингера"]},
     {lines : ["читать", "названия", "<br>", "речных", "пароходов"]},
     {lines : ["<font color='red'>октябрь", "2019 </font>"]},
     {lines : ["Кукин", "яичницу"]},
     {lines : ["сначала", "уберись", "<br>", "потом", "убирайся"], epigraph : "[не из Бродского]"},
     {lines : ["я тот", "кто триста лет", "<br>", "топчет", "чужой газон"]},
     {lines : ["снился", "номер СНИЛСа", "<br>", "чексумма", "совпала"]},
     {lines : ["половник", "половник", "<br>", "полковник", "поклонник"]},
     {lines : ["и шарик", "улетел", "<br>", "и мячик", "утонул"]},
     {lines : ["полный ан", "жамбеман"]},
     {lines : ["Пан'ы", "все в Варшаве"]},
     {lines : ["швейцарцы", "у вас есть"]}, 
     {lines : ["парить", "парить парить", "<br>", "тонуть", "тонуть тонуть"], epigraph : "[из Игоря Фёдорова]"},
     {lines : ["сумерки", "природа", "<br>", "флейты", "голос нервный", "<br>", "позднее", "катанье"], epigraph : "[из Окуджавы]"},
     {lines : ["над пегой", "парою"]}, 
     {lines : ["один", "два е три пи", "<br>", "четыре", "пять шесть семь", "<br>", "восемь", "десять десять"]},
     {lines : ["ягоды", "варенья", "<br>", "стихи", "поэзии"]},
     {lines : ["женская", "атланта", "<br>", "мужской", "кариатид"]},
     {lines : ["Ахилл", "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;черепаха"]},
     {lines : ["чистка зуб", "чистка зуб"]},
     {lines : ["купец", "легионер"]},
     {lines : ["пиши", "наискосок"]},
     {lines : ["<font color='red'>сентябрь", "2019 </font>"]},
     {lines : ["ночью", "очень чудно"], epigraph : "[из Всеволода Некрасова]"},
     {lines : ["варенье", "в июне", "<br>", "варенье", "в июле", "<br>", "варенье", "в августе"]},
     {lines : ["шёпот", "непогоды"]},
     {lines : ["не дискурс", "а дискурс"]},
     {lines : ["в тиши", "кабинета", "<br>", "слагаю", "танкеты"]},
     {lines : ["вишня", "на сакуре"]},
     {lines : ["Велимир", "Казимир"]},
     {lines : ["бабочка", "ряженка"]},
     {lines : ["такого", "как Пушкин"]},
     {lines : ["ради", "двух-трёх лайков", "<br>", "миллион", "дислайков"]},
     {lines : ["ещё и", "картавит"]},
     {lines : ["любовь", "мамонтёнок"]},
     {lines : ["рубины", "рябины"]},
     {lines : ["Рубинштейн", "это я"]},
     {lines : ["безумный", "неземной"]},
     {lines : ["мое", "невпихуе"]},
     {lines : ["<font color='red'>август", "2019 </font>"]},
     {lines : ["негр с догом", "мгновение"]},
     {lines : ["весной", "повеяло"]},
     {lines : ["кричат", "винтер винтер"]},
     {lines : ["ручей", "мостик в лесу"]},
     {lines : ["дневник", "моих побед", "<br>", "ночник", "ничьих ничьих"]},
     {lines : ["бумага", "бумага", "<br>", "бумага", "бумага", "<br>", "бумага", "ножницы"]},
     {lines : ["щетина", "нищета"]},
     {lines : ["тихая", "обитель"]},
     {lines : ["бабочка", "человек", "<br>", "человек", "бабочка"]},
     {lines : ["Вечер", "Золотой Плёс"]},
     {lines : ["<font color='red'>июль", "2019 </font>"]},
     {lines : ["трубка", "это трубка"]},
     {lines : ["король", "король конь слон"]},
     {lines : ["крыши", "снег крыши снег"]},
     {lines : ["нарцисс", "неотразим"]},
     {lines : ["алфавит", "плодовит"]},
     {lines : ["над вечным", "покоем", "<br>", "голос", "Левитана"]},
     {lines : ["Сталин", "на душу нас."]},
     {lines : ["носок", "другой носок"]},
     {lines : ["<font color='red'>июнь", "2019 </font>"]},
     {lines : ["детские", "ботинки"]},
     {lines : ["ЧэГэКа", "ВэВэВэ"]},
     {lines : ["я неян", "и неинь"]},
     {lines : ["советский", "тильзитер"]},
     {lines : ["Мирослав", "Немиров"]},
     {lines : ["стрелял", "промахнулся"]},
     {lines : ["холодно", "в твиттере"]},
     {lines : ["<font color='red'>май", "2019 </font>"]},
     {lines : ["хачу", "хачапури"]},
     {lines : ["зебры", "ЗЫ берёзы"]}
     
     ]});
});



app.get('/first-last', (req, res) => {
     res.render('poems', { 
     title: "Первая и последняя строка",
     poems : [
     {lines : ["Лобзай меня", "и бедных людей)"], epigraph: "Ахметьев"},
     {lines : ["Я глянул в зеркало с утра", "И страшно стало"], epigraph: "Пригов"},
     {lines : ["Женщина в метро меня лягнула", "просто я как личность выше был"], epigraph: "Пригов"},
     {lines : ["Вот День Рыбака —  это День Рыбака", "А сам он —  какой-то рыбак."], epigraph: "Пригов"},
     {lines : ["мне очень нравится когда", "везде туман везде вода"], epigraph: "Кропивницкий"},
     {lines : ["Не мысля гордый свет забавить,", "как я с Онегиным моим."]},
     {lines : ["Я был знаком с берлинским палачом,", "Мне нечего сказать: он был чекистом."], epigraph: "Домбровский"}
     ]
     });
});


app.get('/riddles', (req, res) => {
     res.render('poems', { 
     title: "Загадаки",
     preface: "Мои названия чужих стихов. Даётся в форме перевёрнутой отгадки снизу. Такой жанр.",
     poems : [
         {lines : ["исчезнут", "грёзы", "печали", "сны", "<br>", "останутся простые числа", "<br>"], epigraph: "Карен Джангиров",
     reverse: "[ Решето Эратосфена ]"},
     {lines : ["Я слышал крики и не оглянулся", "<br>"], epigraph: "Герман Лукомников", reverse: "[ The Voice ]"},
                {lines : ["Пред испанкой благородной", "Двое рыцарей стоят.", "Оба смело и свободно", "В очи прямо ей глядят.", 
               "Блещут оба красотою,", "Оба сердцем горячи,", "Оба мощною рукою", "Оперлися на мечи.", "Жизни им она дороже",
              "И, как слава, им мила;", "Но один ей мил — кого же", "Дева сердцем избрала?", 
               "«Кто, реши, любим тобою?»-", "Оба деве говорят", "И с надеждой молодою", "В очи прямо ей глядят."], epigraph: "А. С. Пушкин",
     reverse: "[ Каспаров-Крамник ]"},
     
     
                ]
     });
});


app.get('/', (req, res) => {
     res.render('index', { 
         title: "Разностишия",
         pages : [
             
             {name : "26", title : "Танкетки"},
             {name : "zh-p", title : "Журнал Прыщ"},
             {name : "monostichs", title : "Моностихи", hint: "Мой твиттер с моностихами."},
             {name : "instapoetry", title : "Инстапоэзия", hint: "Мой инстаграм с медитативной лирикой)"},
             {name : "hello_world_poetry", title : "Стихи погромиста", hint: "Телеграм канал, дневник программиста."},
             {name : "forks", title : "Форки", hint: "Бесконечные вариации одного (обычно чужого) стихотворения."},
             {name : "bites", title : "Байты", hint: "Минимальные кусочки известных стихов."},
             {name : "landscapes", title : "Пейзажная лирика"},
             {name : "plagiarism", title : "Плагиат"},
             {name : "2", title : "Два слова"},
             {name : "polpotolok", title : "Полпотолок"},
             {name : "haiku_minus_plus", title : "Хокку-+"},
             {name : "train", title : "Поезда"},
             {name : "samara", title : "АСМРы  Самары"},
             {name : "42", title : "Танкетки 42"},
             {name : "riddles", title : "Загадки"},
             
             {name : "bananals", title : "Банальности"},
             {name : "12", title : "Слова в две строки"},
             {name : "noumenon", title : "Вещь в себе"}
             //{name : "redblack", title : "Редблеки"},
             //{name : "trip", title : "Поездки"},
             //{name : "rotki", title : "Ротки"},
             //{name : "squeeze", title : "Выжимки"},
             //{name : "auto_26", title : "Автотанкетки"},
             //{name : "poroshki", title : "Порошки"},
             //{name : "artichokes", title : "Артишоки"},
             //{name : "side", title : "Взгляд сбоку"},
             //{name : "575", title : "Строгие хокку"},
             //{name : "haiku", title : "Свободные хокку"},
             //{name : "gariks", title : "Гарики"},
             //{name : "love_lyrics", title : "Посредственное кофе"},
             //{name : "words", title : "Неологизмы"},
             //{name : "cmuxu-o-cmuxax-o-cmuxax", title : "Cmuxu o Cmuxax o Cmuxax"},
             //{name : "chess", title : "Шахматы"},
             
         ]          
     });
});

app.listen(80, () => {
    console.log('server is starting at port... ', 80);
});
